In [2]:
#Date-10/30/22
#1-split the following dataframe into groups based on school code. Also check the type of GroupBy object
import pandas as pd
student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

print("Original Dataframe")
print(student_data)

print("split the data by schoo_code")
result=student_data.groupby(['school_code'])
for name,group in result:
    print("\nGroup")
    print(name)
    print(group)
    
print("\nType of the object:")
print(type(result))

Original Dataframe
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S2        s002     V    Gino Mcneill     17/05/2002   12     192      32
S3        s003    VI     Ryan Parkes     16/02/1999   13     186      33
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30
S5        s002     V    Gino Mcneill     11/05/2002   14     151      31
S6        s004    VI    David Parkes     15/09/1997   12     159      32

    address
S1  street1
S2  street2
S3  street3
S4  street1
S5  street2
S6  street4
split the data by schoo_code

Group
s001
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30

    address
S1  street1
S4  street1

Group
s002
   school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2

Group
s003
   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3

Group
s004
   school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4

Type of the object:
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [12]:
#2-split the following dataframe by school code and get mean, min, and max value of age for each school
import pandas as pd

student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

result=student_data.groupby(['school_code'])

for code, group in result:
    print(code)
    print("Max age of group=",group['age'].max())
    print("Minimum age of group=",group['age'].min())
    print("average of group age=",group['age'].mean())
    print('\n',group)
    print()

s001
Max age of group= 13
Minimum age of group= 12
average of group age= 12.5

    school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30

    address
S1  street1
S4  street1

s002
Max age of group= 14
Minimum age of group= 12
average of group age= 13.0

    school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2

s003
Max age of group= 13
Minimum age of group= 13
average of group age= 13.0

    school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3

s004
Max age of group= 12
Minimum age of group= 12
average of group age= 12.0

    school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4

In [14]:
#method02
print('\nMean, min, and max value of age for each value of the school:')
grouped=student_data.groupby('school_code').agg({'age':['mean','max','min']})
print(grouped)

Mean, min, and max value of age for each value of the school:
              age
             mean max min
school_code
s001         12.5  13  12
s002         13.0  14  12
s003         13.0  13  13
s004         12.0  12  12

In [15]:
#3-split the following given dataframe into groups based on school code and class
multiple_criteria_group=student_data.groupby(['school_code','class'])
for criteria,group in multiple_criteria_group:
    print(criteria)
    print(group)

('s001', 'V')
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35

    address
S1  street1
('s001', 'VI')
   school_code class          name date_Of_Birth   age  height  weight  \
S4        s001    VI  Eesha Hinton     25/09/1998   13     167      30

    address
S4  street1
('s002', 'V')
   school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2
('s003', 'VI')
   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3
('s004', 'VI')
   school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4

In [16]:
#4-split the following given dataframe into groups based on school code and cast grouping as a list
result=student_data.groupby(['school_code'])
print(list(result))

[('s001',    school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30

    address
S1  street1
S4  street1  ), ('s002',    school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2  ), ('s003',    school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3), ('s004',    school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4  )]

In [17]:
#5-split the following given dataframe into groups based on single column and multiple columns.
#Find the size of the grouped data
result_single_column=student_data.groupby('school_code')
print("size of the singly columned group=",result_single_column.size())
result_multiple_columns=student_data.groupby(['school_code','class'])
print("size of the singly columned group=",result_multiple_columns.size())

size of the singly columned group= school_code
s001    2
s002    2
s003    1
s004    1
dtype: int64
size of the singly columned group= school_code  class
s001         V        1
             VI       1
s002         V        2
s003         VI       1
s004         VI       1
dtype: int64

In [18]:
#6-split the following given dataframe into groups based on school code and call a specific group with the name of the group.
result=student_data.groupby(['school_code'])
for code,group in result:
    if code=='s003':
        print(code)
        print(group)

s003
   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3

In [20]:
#Alternate Method
print('\nSplit the said data on school_code wise:')
result=student_data.groupby(['school_code'])
print("Call school code 's001':")
print(result.get_group('s001'))

Split the said data on school_code wise:
Call school code 's001':
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30

    address
S1  street1
S4  street1

In [22]:
#7-to split a dataset, group by one column and get mean, min, and max values by group. 
#Using the following dataset find the mean, min, and max values of purchase amount (purch_amt) 
#group by customer id (customer_id).
import pandas as pd

pd.set_option('display.max_rows', None)
orders_data = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})
print("Original Orders DataFrame:")
print(orders_data)

grouped=orders_data.groupby(['customer_id'])

print("Average, Minimum Valu, Maximum Value of the purchase amunt of each group")
print(grouped.agg({'purch_amt':['mean','max','min']}))

Original Orders DataFrame:
    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3005         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3002         5001
3    70004     110.50  2012-08-17         3009         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3007         5001
6    70008    5760.00  2012-09-10         3002         5001
7    70010    1983.43  2012-10-10         3004         5006
8    70003    2480.40  2012-10-10         3009         5003
9    70012     250.45  2012-06-27         3008         5002
10   70011      75.29  2012-08-17         3003         5007
11   70013    3045.60  2012-04-25         3002         5001
Average, Minimum Valu, Maximum Value of the purchase amunt of each group
               purch_amt
                    mean      max      min
customer_id
3001          270.650000   270.65   270.65
3002         2956.953333  5760.00    65.26
3003           75.290000    75.29    75.29
3004         1983.430000  1983.43  1983.43
3005          549.500000   948.50   150.50
3007         2400.600000  2400.60  2400.60
3008          250.450000   250.45   250.45
3009         1295.450000  2480.40   110.50

In [23]:
#8-split a dataset to group by two columns and count by each row
result=orders_data.groupby(['customer_id','salesman_id']).agg('count')
print(result)

                         ord_no  purch_amt  ord_date
customer_id salesman_id
3001        5005              1          1         1
3002        5001              3          3         3
3003        5007              1          1         1
3004        5006              1          1         1
3005        5002              2          2         2
3007        5001              1          1         1
3008        5002              1          1         1
3009        5003              2          2         2

In [24]:
result=orders_data.groupby(['salesman_id','customer_id']).size().reset_index().groupby(['salesman_id','customer_id'])[[0]].max()
print(result)

                         0
salesman_id customer_id
5001        3002         3
            3007         1
5002        3005         2
            3008         1
5003        3009         2
5005        3001         1
5006        3004         1
5007        3003         1

In [34]:
#9- split a dataset to group by two columns and then sort the aggregated results within the groups
df_agg=orders_data.groupby(['customer_id','salesman_id']).agg({'purch_amt':'sum'})
result=df_agg['purch_amt'].groupby(level=0,group_keys=False)
print(result.nlargest())

customer_id  salesman_id
3001         5005            270.65
3002         5001           8870.86
3003         5007             75.29
3004         5006           1983.43
3005         5002           1099.00
3007         5001           2400.60
3008         5002            250.45
3009         5003           2590.90
Name: purch_amt, dtype: float64

In [36]:
#10-split the following dataframe into groups based on customer id and create a list of order date for each group.
result=orders_data.groupby(['customer_id'])['ord_date'].apply(list)
print(result)

customer_id
3001                            [2012-09-10]
3002    [2012-10-05, 2012-09-10, 2012-04-25]
3003                            [2012-08-17]
3004                            [2012-10-10]
3005                [2012-10-05, 2012-09-10]
3007                            [2012-07-27]
3008                            [2012-06-27]
3009                [2012-08-17, 2012-10-10]
Name: ord_date, dtype: object

In [39]:
#11- split the following dataframe into groups and calculate monthly purchase amount.
#result=orders_data.groupby(['customer_id'])
orders_data['ord_date']=pd.to_datetime(orders_data['ord_date'])
print("\nMonth wise purchase amount:")
result=orders_data.set_index('ord_date').groupby(pd.Grouper(freq='M')).agg({'purch_amt':sum})
print(result)

Month wise purchase amount:
            purch_amt
ord_date
2012-04-30    3045.60
2012-05-31       0.00
2012-06-30     250.45
2012-07-31    2400.60
2012-08-31     185.79
2012-09-30    6979.15
2012-10-31    4679.59

In [42]:
#12- split the following dataframe into groups, group by month and year based on order date and find the total purchase amount year wise, month wise
orders_data['ord_date_month']=pd.to_datetime(orders_data['ord_date'])
print("\nMonth wise purchase amount:")
result_month=orders_data.set_index('ord_date_month').groupby(pd.Grouper(freq='M')).agg({'purch_amt':sum})
result_year=orders_data.set_index('ord_date_month').groupby(pd.Grouper(freq='Y')).agg({'purch_amt':sum})

print(result_month)
print("\nYear wise purchase amount:")
print(result_year)

Month wise purchase amount:
                purch_amt
ord_date_month
2012-04-30        3045.60
2012-05-31           0.00
2012-06-30         250.45
2012-07-31        2400.60
2012-08-31         185.79
2012-09-30        6979.15
2012-10-31        4679.59

Year wise purchase amount:
                purch_amt
ord_date_month
2012-12-31       17541.18

In [45]:
#alternate
import pandas as pd
orders_data = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['05-10-2012','09-10-2012','05-10-2013','08-17-2013','10-09-2013','07-27-2014','10-09-2012','10-10-2012','10-10-2012','06-17-2014','07-08-2012','04-25-2012'],
'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

orders_data['ord_date']=pd.to_datetime(orders_data['ord_date'])
print("\nYear wise Month wise purchase amount:")
result=orders_data.groupby([orders_data['ord_date'].dt.year,orders_data['ord_date'].dt.month]).agg({'purch_amt':sum})
print(result)

Year wise Month wise purchase amount:
                   purch_amt
ord_date ord_date
2012     4           3045.60
         5            150.50
         7             75.29
         9            270.65
         10         10223.83
2013     5             65.26
         8            110.50
         10           948.50
2014     6            250.45
         7           2400.60

In [53]:
#13- split the following dataframe into groups based on first column and set other column values into a list of values
import pandas as pd
df = pd.DataFrame( {'X' : [10, 10, 10, 20, 30, 30, 10], 
                    'Y' : [10, 15, 11, 20, 21, 12, 14], 
                    'Z' : [22, 20, 18, 20, 13, 10, 0]})

result=df.groupby(df.iloc[0])
for code,group in result:
    print(code)
    print(group)

In [55]:
result=df.groupby('X').aggregate(lambda tdf:tdf.unique().tolist())
print(result)

                   Y                Z
X
10  [10, 15, 11, 14]  [22, 20, 18, 0]
20              [20]             [20]
30          [21, 12]         [13, 10]

In [57]:
#14- split the following dataframe into groups based on all columns and calculate Groupby value counts on the dataframe.
import pandas as pd
df=pd.DataFrame( {'id' : [1, 2, 1, 1, 2, 1, 2], 
                    'type' : [10, 15, 11, 20, 21, 12, 14], 
                    'book' : ['Math','English','Physics','Math','English','Physics','English']})
result=df.groupby(['id','type','book']).size().unstack(fill_value=0)
print(result)

book     English  Math  Physics
id type
1  10          0     1        0
   11          0     0        1
   12          0     0        1
   20          0     1        0
2  14          1     0        0
   15          1     0        0
   21          1     0        0

In [60]:
#15-split the following dataframe into groups and count unique values of 'value' column
import pandas as pd
df = pd.DataFrame({
    'id': [1, 1, 2, 3, 3, 4, 4, 4],
    'value': ['a', 'a', 'b', None, 'a', 'a', None, 'b']
})
print("original dataframe")
print(df)

print("count uniq values")
print(df.groupby('value')['id'].unique())
print(df.groupby('value')['id'].nunique())

original dataframe
   id value
0   1     a
1   1     a
2   2     b
3   3  None
4   3     a
5   4     a
6   4  None
7   4     b
count uniq values
value
a    [1, 3, 4]
b       [2, 4]
Name: id, dtype: object
value
a    3
b    2
Name: id, dtype: int64

In [61]:
#16-split a given dataframe into groups and list all the keys from the GroupBy object
import pandas as pd
pd.set_option('display.max_rows', None)
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

print("\nSplit the data on school_code:");
result=df.groupby('school_code')
print(result.groups.keys())

Split the data on school_code:
dict_keys(['s001', 's002', 's003', 's004'])

In [64]:
#17-split a given dataframe into groups and create a new column with count from GroupBy
import pandas as pd
df = pd.DataFrame({
'book_name':['Book1','Book2','Book3','Book4','Book1','Book2','Book3','Book5'],
'book_type':['Math','Physics','Computer','Science','Math','Physics','Computer','English'],
'book_id':[1,2,3,4,1,2,3,5]})

#df['count']=df.groupby('book_type').agg({'book_name':'count'})
result=df.groupby(['book_name','book_type'])['book_type'].count().reset_index(name='count')
print(result)

  book_name book_type  count
0     Book1      Math      2
1     Book2   Physics      2
2     Book3  Computer      2
3     Book4   Science      1
4     Book5   English      1

In [66]:
#18-split a given dataframe into groups with bin counts
import pandas as pd
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
'sales_id':[5002,5003,5004,5003,5002,5001,5005,5007,5008,5004,5005,5001]})

groups=df.groupby(['customer_id',pd.cut(df.sales_id,3)])
result=groups.size().unstack()
print(result)

sales_id     (5000.993, 5003.333]  (5003.333, 5005.667]  (5005.667, 5008.0]
customer_id
3001                            1                     0                   0
3002                            1                     2                   0
3003                            0                     1                   0
3004                            0                     0                   1
3005                            2                     0                   0
3007                            1                     0                   0
3008                            0                     1                   0
3009                            1                     0                   1

In [68]:
#19-split a given dataframe into groups with multiple aggregations
import pandas as pd
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s001'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
result=df.groupby(['school_code','class']).agg({'height': ['max', 'mean'],
                                 'weight': ['sum','min','count']})
print(result)

                  height        weight
                     max   mean    sum min count
school_code class
s001        V        173  173.0     35  35     1
            VI       167  163.0     62  30     2
s002        V        192  171.5     63  31     2
s003        VI       186  186.0     33  33     1

In [70]:
#20-split a given dataframe into groups and display target column as a list of unique values.
import pandas as pd

df = pd.DataFrame( {'id' : ['A','A','A','A','A','A','B','B','B','B','B'], 
                    'type' : [1,1,1,1,2,2,1,1,1,2,2], 
                    'book' : ['Math','Math','English','Physics','Math','English','Physics','English','Physics','English','English']})

new_df=df[['id','type','book']].drop_duplicates().groupby(['id','type'])['book'].apply(list).reset_index()
print(new_df)

  id  type                      book
0  A     1  [Math, English, Physics]
1  A     2           [Math, English]
2  B     1        [Physics, English]
3  B     2                 [English]

In [71]:
#21- split the following dataframe into groups and calculate quarterly purchase amount
import pandas as pd
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['05-10-2012','09-10-2012','05-10-2012','08-17-2012','10-09-2012','07-27-2012','10-09-2012','10-10-2012','10-10-2012','06-17-2012','07-08-2012','04-25-2012'],
'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

df['ord_date']=pd.to_datetime(df['ord_date'])
result=df.set_index('ord_date').groupby(pd.Grouper(freq='Q')).agg({'purch_amt':sum})
print(result)

            purch_amt
ord_date
2012-06-30    3511.81
2012-09-30    2857.04
2012-12-31   11172.33

In [72]:
#22-split the following dataframe into groups by school code and get mean, min, and max value of age with customized column name for each school.
import pandas as pd
student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    ' height ': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

result=student_data.groupby('school_code').agg(Age_Mean = ('age','mean'),Age_Max=('age',max),Age_Min=('age',min))
print(result)

             Age_Mean  Age_Max  Age_Min
school_code
s001             12.5       13       12
s002             13.0       14       12
s003             13.0       13       13
s004             12.0       12       12

In [2]:
#23-split the following datasets into groups on customer id and calculate the number of customers starting with 'C', the list of all products and the difference of maximum purchase amount and minimum purchase amount
import pandas as pd

df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'ord_date': ['05-10-2012','09-10-2012','05-10-2012','08-17-2012','10-09-2012','07-27-2012','10-09-2012','10-10-2012','10-10-2012','06-17-2012','07-08-2012','04-25-2012'],
'customer_id':['C3001','C3001','D3005','D3001','C3005','D3001','C3005','D3001','D3005','C3001','D3005','D3005'],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

def customer_id_c(x):
    return (x.str[0]=='C').sum()
result=df.groupby(['salesman_id']).agg(customer_id_c=('customer_id',customer_id_c),
                                      customer_id_list=('customer_id',lambda x:','.join(x)),
                                      purch_amt_gap=('purch_amt',lambda x:x.max()-x.min()))
print("\nNumber of customers  starting with ‘C’, the list of all products and the difference of maximum purchase amount and minimum purchase amount:")
print(result)

Number of customers  starting with ‘C’, the list of all products and the difference of maximum purchase amount and minimum purchase amount:
             customer_id_c         customer_id_list  purch_amt_gap
salesman_id
5001                     1  D3005,D3001,C3005,D3005        5694.74
5002                     3        C3001,C3005,C3001         798.00
5003                     0              D3001,D3005        2369.90
5005                     1                    C3001           0.00
5006                     0                    D3001           0.00
5007                     0                    D3005           0.00

In [5]:
#24-split the following datasets into groups on customer_id to summarize purch_amt and calculate percentage of purch_amt in each group
result=df.groupby(['customer_id','salesman_id']).agg({'purch_amt':sum})
result['%purch_amt']=result.apply(lambda x:100*x/x.sum())
print(result)

                         purch_amt  %purch_amt
customer_id salesman_id
C3001       5002            400.95    2.285764
            5005            270.65    1.542941
C3005       5001           5760.00   32.837016
            5002            948.50    5.407276
D3001       5001           2400.60   13.685510
            5003            110.50    0.629946
            5006           1983.43   11.307278
D3005       5001           3110.86   17.734611
            5003           2480.40   14.140440
            5007             75.29    0.429219

In [6]:
#25-split a dataset, group by one column and get mean, min, and max values by group, 
#also change the column name of the aggregated metric. Using the following dataset 
#find the mean, min, and max values of purchase amount (purch_amt) group by customer id (customer_id).

import pandas as pd
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

grouped_single=df.groupby('school_code').agg({'age':[("mean_age","mean"), ("min_age", "min"), ("max_age","max")]})
print(grouped_single)

                 age
            mean_age min_age max_age
school_code
s001            12.5      12      13
s002            13.0      12      14
s003            13.0      13      13
s004            12.0      12      12

In [8]:
#26-split a given dataset, group by two columns and convert other columns of the dataframe into a dictionary with column header as key

dict_data_list=list()

for code,group in df.groupby(['school_code','class']):
    grp=dict(zip(['school_code','class'],code))
    ocolumns_list=list()
    
    for _,data in group.iterrows():
        data=data.drop(labels=['school_code','class'])
        ocolumns_list.append(data.to_dict())
        
    group['other_columns'] = ocolumns_list
    dict_data_list.append(group)
    
print(dict_data_list)

[   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35

    address                                      other_columns
S1  street1  {'name': 'Alberto Franco', 'date_Of_Birth ': '...  ,    school_code class          name date_Of_Birth   age  height  weight  \
S4        s001    VI  Eesha Hinton     25/09/1998   13     167      30

    address                                      other_columns
S4  street1  {'name': 'Eesha Hinton', 'date_Of_Birth ': '25...  ,    school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address                                      other_columns
S2  street2  {'name': 'Gino Mcneill', 'date_Of_Birth ': '17...
S5  street2  {'name': 'Gino Mcneill', 'date_Of_Birth ': '11...  ,    school_code class         name date_Of_Birth   age  height  weight  \
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33

    address                                      other_columns
S3  street3  {'name': 'Ryan Parkes', 'date_Of_Birth ': '16/...  ,    school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address                                      other_columns
S6  street4  {'name': 'David Parkes', 'date_Of_Birth ': '15...  ]

In [10]:
#27-split a given dataset, group by one column and apply an aggregate function to few columns and another aggregate function to the rest of the columns of the dataframe.
import pandas as pd

df = pd.DataFrame({
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001],
'sale_jan':[150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 1760, 2983.43, 480.4,  1250.45, 75.29,1045.6],
'sale_feb':[250.5, 170.65, 15.26, 110.5, 598.5, 1400.6, 2760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_mar':[150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_apr':[150.5, 270.65, 95.26, 210.5, 948.5, 2400.6, 760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_may':[130.5, 270.65, 65.26, 310.5, 948.5, 2400.6, 760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_jun':[150.5, 270.65, 45.26, 110.5, 948.5, 3400.6, 5760, 983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_jul':[950.5, 270.65, 65.26, 210.5, 948.5, 2400.6, 5760, 983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_aug':[150.5, 70.65,  65.26, 110.5, 948.5, 400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_sep':[150.5, 270.65, 65.26, 110.5, 948.5, 200.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_oct':[150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_nov':[150.5, 270.65, 95.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6], 
'sale_dec':[150.5, 70.65, 65.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6]
})

print("\Result after group on salesman_id and apply different aggregate functions:")
df=df.groupby('salesman_id').agg(lambda x:x.sum() if x.name in ['sale_jan','sale_feb','sale_mar'] else x.mean())
print(df)

\Result after group on salesman_id and apply different aggregate functions:
             sale_jan  sale_feb  sale_mar     sale_apr  sale_may     sale_jun  \
salesman_id
5001          5271.46   7221.46  11271.46  1575.365000  1567.865  3062.865000
5002          2349.45   1099.45   1349.45   449.816667   443.150   449.816667
5003           590.90   2590.90   2590.90  1345.450000  1395.450  1295.450000
5005           270.65    170.65    270.65   270.650000   270.650   270.650000
5006          2983.43   1983.43   1983.43  1983.430000  1983.430   983.430000
5007            75.29     75.29     75.29    75.290000    75.290    75.290000

                sale_jul     sale_aug     sale_sep     sale_oct     sale_nov  \
salesman_id
5001         2817.865000  2317.865000  2267.865000  2817.865000  2825.365000
5002          716.483333   449.816667   449.816667   449.816667   449.816667
5003         1345.450000  1295.450000  1295.450000  1295.450000  1295.450000
5005          270.650000    70.650000   270.650000   270.650000   270.650000
5006          983.430000  1983.430000  1983.430000  1983.430000  1983.430000
5007           75.290000    75.290000    75.290000    75.290000    75.290000

                sale_dec
salesman_id
5001         2817.865000
5002          449.816667
5003         1295.450000
5005           70.650000
5006         1983.430000
5007           75.290000

In [15]:
#28-split a given dataset, group by one column and remove those groups if all the values of a specific columns are not available
import pandas as pd
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'weight': [173, 192, 186, 167, 151, 159],
    'height': [35, None, 33, 30, None, 32]},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
result=df[(~df['height'].isna()).groupby(df['school_code']).transform('any')]
print(result)

   school_code class            name date_Of_Birth   age  weight  height
S1        s001     V  Alberto Franco     15/05/2002   12     173    35.0
S3        s003    VI     Ryan Parkes     16/02/1999   13     186    33.0
S4        s001    VI    Eesha Hinton     25/09/1998   13     167    30.0
S6        s004    VI    David Parkes     15/09/1997   12     159    32.0

In [16]:
#29-split a given dataset using group by on specified column into two labels and ranges
import pandas as pd
import numpy as np

df = pd.DataFrame({
'salesman_id': [5001,5002,5003,5004,5005,5006,5007,5008,5009,5010,5011,5012],
'sale_jan':[150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 1760, 2983.43, 480.4,  1250.45, 75.29,1045.6]})

result=df.groupby(pd.cut(df['salesman_id'],bins=[0,5006,np.inf],labels=['s1','s2']))['sale_jan'].sum().reset_index()
print(result)

  salesman_id  sale_jan
0          s1   3946.01
1          s2   7595.17

In [20]:
#30-split the following dataset using group by on first column and aggregate over multiple lists on second column
import pandas as pd
import numpy as np
df = pd.DataFrame({
    'student_id': ['S001','S001','S002','S002','S003','S003'],
    'marks': [[88,89,90],[78,81,60],[84,83,91],[84,88,91],[90,89,92],[88,59,90]]})
print(df)
print("\nGroupby and aggregate over multiple lists:")
result=df.set_index('student_id')['marks'].groupby('student_id').apply(list).apply(lambda x: np.mean(x,0))
print(result)

  student_id         marks
0       S001  [88, 89, 90]
1       S001  [78, 81, 60]
2       S002  [84, 83, 91]
3       S002  [84, 88, 91]
4       S003  [90, 89, 92]
5       S003  [88, 59, 90]

Groupby and aggregate over multiple lists:
student_id
S001    [83.0, 85.0, 75.0]
S002    [84.0, 85.5, 91.0]
S003    [89.0, 74.0, 91.0]
Name: marks, dtype: object

In [21]:
#31-split the following dataset using group by on 'salesman_id' and find the first order date for each group
import pandas as pd
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5004,5003,5002,5004,5001]})

result=df.groupby('salesman_id')['ord_date'].min()
print(result)

salesman_id
5001    2012-04-25
5002    2012-06-27
5003    2012-08-17
5004    2012-08-17
5005    2012-09-10
Name: ord_date, dtype: object

In [23]:
#32-split a given dataset using group by on multiple columns and drop last n rows of from each group
import pandas as pd
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3002,3001,3001,3003,3002,3002,3001,3004,3003,3002,3003,3001],
'salesman_id':[5002,5003,5001,5003,5002,5001,5001,5003,5003,5002,5003,5001]})

result=df.groupby(['salesman_id','customer_id'])

for name,group in result:
    print("\nGroup:")
    print(name)
    print(group)
n = 2

result1=df.drop(df.groupby(['salesman_id', 'customer_id']).tail(n).index,axis=0)
print("\nDroping last two records:")
print(result1)

Group:
(5001, 3001)
    ord_no  purch_amt    ord_date  customer_id  salesman_id
2    70002      65.26  2012-10-05         3001         5001
6    70008    5760.00  2012-09-10         3001         5001
11   70013    3045.60  2012-04-25         3001         5001

Group:
(5001, 3002)
   ord_no  purch_amt    ord_date  customer_id  salesman_id
5   70005     2400.6  2012-07-27         3002         5001

Group:
(5002, 3002)
   ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001     150.50  2012-10-05         3002         5002
4   70007     948.50  2012-09-10         3002         5002
9   70012     250.45  2012-06-27         3002         5002

Group:
(5003, 3001)
   ord_no  purch_amt    ord_date  customer_id  salesman_id
1   70009     270.65  2012-09-10         3001         5003

Group:
(5003, 3003)
    ord_no  purch_amt    ord_date  customer_id  salesman_id
3    70004     110.50  2012-08-17         3003         5003
8    70003    2480.40  2012-10-10         3003         5003
10   70011      75.29  2012-08-17         3003         5003

Group:
(5003, 3004)
   ord_no  purch_amt    ord_date  customer_id  salesman_id
7   70010    1983.43  2012-10-10         3004         5003

Droping last two records:
   ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001     150.50  2012-10-05         3002         5002
2   70002      65.26  2012-10-05         3001         5001
3   70004     110.50  2012-08-17         3003         5003